app/controllers/sessions_controller.rb

	def create
    	user = User.find_or_create_by(:uid => auth['uid']) do |u|
---
INSERT INTO "users" ("uid", "created_at", "updated_at") VALUES (?, ?, ?)  [["uid", 1], ["created_at", "2017-02-16 18:20:46.635469"], ["updated_at", "2017-02-16 18:20:46.635469"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", 1]]